app/controllers/documents_controller.rb

INSERT INTO "documents" ("additional_sessions", "architect_id", "created_at", "first_spouse_email", "first_spouse_first_name", "first_spouse_last_name", "first_spouse_signature_id", "price", "second_spouse_email", "second_spouse_first_name", "second_spouse_last_name", "second_spouse_signature_id", "terms", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @document = Document.build(document_params, current_user)

    respond_to do |format|
      if @document.save

SELECT "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_document
      @document = Document.find(params[:id])